{
    "BNN (Bispectral Neural Networks)": "Utilize higher-order spectral features for improved signal processing and pattern recognition tasks, enhancing traditional neural network capabilities.",
    "AutoGPT": "Autonomous AI agent that uses GPT-4 to generate prompts for itself, enabling it to complete tasks with minimal human intervention.",
    "C2PA (Coalition for Content Provenance and Authenticity)": "Initiative focused on establishing industry standards for authenticating digital media content to combat misinformation and ensure content provenance.",
    "ChatGPT": "Advanced conversational AI model developed by OpenAI based on the GPT architecture, designed to generate human-like text responses.",
    "Autonomous Learning": "Systems capable of learning and adapting their strategies or knowledge without human intervention, based on their interactions with the environment.",
    "LLE (Locally Linear Embedding)": "Nonlinear dimensionality reduction technique that preserves local neighborhood information to reduce high-dimensional data to a lower-dimensional space.",
    "Agent": "System capable of perceiving its environment through sensors and acting upon that environment to achieve specific goals.",
    "Collaborative Intelligence": "Synergy between human intelligence and AI to achieve outcomes neither could accomplish alone.",
    "Adaptive Dual-Scale Denoising": "Denoising approach designed to balance both local and global feature extraction in models, particularly in the context of diffusion-based generative models. This method aims to enhance image quality by dynamically adjusting denoising processes across different spatial scales.",
    "Invariance": "Property of a model or algorithm that ensures its output remains unchanged when specific transformations are applied to the input data.",
    "Misuse": "Application of AI technologies in ways that are unethical, illegal, or harmful to individuals or society.",
    "Autonomous Agents": "Systems capable of independent action in dynamic, unpredictable environments to achieve designated objectives.",
    "Decomposition": "Process of breaking down a complex problem into smaller, more manageable parts that can be solved individually.",
    "Ontology": "Structured framework that categorizes and organizes information or data into a hierarchy of concepts and relationships, facilitating the sharing and reuse of knowledge across systems and domains.",
    "Evolutionary Algorithm": "Optimization methods inspired by the process of natural selection where potential solutions evolve over generations to optimize a given objective function.",
    "Weight Decay": "Regularization technique used in training neural networks to prevent overfitting by penalizing large weights.",
    "Noise": "Irrelevant or meaningless data in a dataset or unwanted variations in signals that can interfere with the training and performance of AI models.",
    "Autoregressive": "Statistical algorithms used in time series forecasting, where future values are predicted based on a weighted sum of past observations.",
    "Generalization": "Ability of a ML model to perform well on new, unseen data that was not included in the training set.",
    "Gödel Code": "Method of encoding mathematical and logical statements as unique natural numbers, introduced by Kurt Gödel as part of his proof of the incompleteness theorems.",
    "Capsule Network": "Type of artificial neural network that aims to more accurately model hierarchical relationships and spatial information in visual data by using groups of neurons called capsules.",
    "Sampling": "Fundamental technique used to reduce computational cost and simplify data management",
    "Move 37": "Pivotal move made by AlphaGo in its second game against Go champion Lee Sedol, which showcased the superior strategic capabilities of AI in the game of Go.",
    "LSTM (Long Short-Term Memory)": "Type of recurrent neural network architecture designed to learn long-term dependencies in sequential data.",
    "ITM (Image-Text Matching)": "AI technique that involves automatically identifying correspondences between textual descriptions and visual elements within images.",
    "Contextual Retrieval": "AI-driven search technique that retrieves information based on the broader context of a query, rather than relying solely on exact keywords or phrases.",
    "Log-Likelihood": "Measure used in statistical models to quantify how well a model predicts a given set of observations, expressed as the logarithm of the likelihood function.",
    "Universal Learning Algorithms": "Theoretical frameworks aimed at creating systems capable of learning any task to human-level competency, leveraging principles that could allow for generalization across diverse domains.",
    "ML (Machine Learning)": "Development of algorithms and statistical models that enable computers to perform tasks without being explicitly programmed for each one.",
    "Bayesian Optimization": "Strategy for optimizing complex, expensive-to-evaluate functions by building a probabilistic model of the function and using it to select the most promising points to evaluate.",
    "Permutation": "Arrangement of all or part of a set of objects in a specific order.",
    "Joint Embedding Architecture": "Neural network design that learns to map different forms of data (e.g., images and text) into a shared embedding space, facilitating tasks like cross-modal retrieval and multi-modal representation learning.",
    "Silent Collapse": "Gradual degradation in the performance of AI models when trained on synthetic data produced by other AIs, leading to a decline in output quality over successive iterations.",
    "Hierarchy of Generalizations": "Conceptual framework in ML that organizes features or representations from specific to general, often used in neural networks to capture varying levels of abstraction in data.",
    "Intention": "Planned or desired outcome that an agent aims to achieve through its actions.",
    "Motor Learning": "Process by which robots or AI systems acquire, refine, and optimize motor skills through experience and practice.",
    "Counterfactual Fairness": "ML concept that ensures decisions remain fair by being unaffected by sensitive attributes, such as race or gender, in hypothetical scenarios where these attributes are altered.",
    "Transformer": "Deep learning model architecture designed for handling sequential data, especially effective in natural language processing tasks.",
    "CoT (Chain of Thought)": "Reasoning method employed in AI that mimics human-like thought processes to solve complex problems by breaking them down into a series of simpler, interconnected steps.",
    "GQN (Generative Query Network)": "Neural network architecture designed to enable machines to understand and generate visual scenes from different viewpoints based on limited observations.",
    "Task Environment": "Setting or context within which an intelligent agent operates and attempts to achieve its objectives.",
    "AI Winter": "Periods of reduced funding and interest in AI research and development, often due to unmet expectations and lack of significant progress.",
    "GAIL (Generative Adversarial Imitation Learning)": "Advanced ML technique that uses adversarial training to enable an agent to learn behaviors directly from expert demonstrations without requiring explicit reward signals.",
    "Fourier Features": "Technique used in ML to transform input data into a higher-dimensional space using sine and cosine functions, which can help models learn more complex patterns.",
    "Fabless": "Company which designs and markets hardware while outsourcing the manufacturing of silicon wafers and chips to specialized semiconductor foundries.",
    "Cross entropy loss": "Loss function used to measure the difference between two probability distributions for a given random variable or set of events.",
    "FSDP (Fully Sharded Data Parallel)": "Distributed training method in deep learning that divides both model parameters and optimizer states across multiple devices to improve efficiency and scalability.",
    "Predictive Analytics": "Using statistical techniques and algorithms to analyze historical data and make predictions about future events.",
    "Equivariance": "Property of a function whereby the function commutes with the actions of a group, meaning that transformations applied to the input result in proportional transformations in the output.",
    "GMM (Gaussian Mixture Models)": "Probabilistic models that assume all data points are generated from a mixture of a finite number of Gaussian distributions with unknown parameters.",
    "SAIF (Secure AI Framework)": "Set of guidelines and best practices developed by Google to enhance the security of AI systems across various applications.",
    "Roko's Basilisk": "Thought experiment proposing that a future all-powerful AI could punish those who did not help bring about its existence.",
    "Confusion Matrix": "Table used to evaluate the performance of a classification model by visualizing its true versus predicted values.",
    "Validation Data": "Subset of data used to assess the performance of a model during the training phase, separate from the training data itself.",
    "Replaced Token Detection": "Method used in self-supervised learning where the task involves identifying or predicting tokens that have been intentionally altered or replaced in a given sequence.",
    "Autonomous Reasoning": "Capacity of AI systems to make independent decisions or draw conclusions based on logic or data without human intervention.",
    "Capsule Networks": "Type of artificial neural network designed to improve the processing of spatial hierarchical information by encoding data into small groups of neurons called capsules.",
    "Inference": "Process by which a trained neural network applies learned patterns to new, unseen data to make predictions or decisions.",
    "LVLMs (Large Vision Language Models)": "Advanced AI systems designed to integrate and interpret both visual and textual data, enabling more sophisticated understanding and generation based on both modalities.",
    "Moloch": "Metaphorical force or systemic dynamic that leads groups or individuals to pursue short-term goals at the expense of long-term well-being or optimal outcomes.",
    "DL (Deep Learning)": "Subset of machine learning that involves neural networks with many layers, enabling the modeling of complex patterns in data.",
    "Logits": "Raw, unnormalized outputs of the last layer in a neural network before applying the softmax function in classification tasks.",
    "Cross Validation": "Statistical method used to estimate the skill of ML models on unseen data by partitioning the original dataset into a training set to train the model and a test set to evaluate it.",
    "Catastrophic Forgetting": "Phenomenon where a neural network forgets previously learned information upon learning new data.",
    "SLAPA (Self-Learning Agent for Performing APIs)": "AI agent designed to autonomously learn and interact with APIs to perform tasks more effectively over time.",
    "Fast Takeoff": "Rapid transition from human-level to superintelligent AI, occurring in a very short period of time.",
    "Gorilla Program": "Concept in AI that illustrates the potential risk of superintelligent machines surpassing human control. It draws an analogy between humans and gorillas, suggesting that just as gorillas have little influence over their future in a world dominated by humans, humanity might similarly lose control in a world dominated by advanced AI systems.",
    "Object Detection": "Computer vision technique that identifies and locates objects within an image or video frame.",
    "ASI (Artificial Super Intelligence)": "Hypothetical form of AI that surpasses human intelligence across all domains, including creativity, general wisdom, and problem-solving capabilities.",
    "Parametric Memory": "Memory architecture where specific memories or facts are stored using parameterized models, often used to improve efficiency in storing and retrieving information in machine learning systems.",
    "Instruction Following Model": "AI system designed to execute tasks based on specific commands or instructions provided by users.",
    "EBM (Energy-Based Model)": "Class of deep learning models that learn to associate lower energy levels with more probable configurations of the input data.",
    "Brain Organoid Reservoir Computing": "Combines the use of brain organoids—3D cultures of human brain cells—with reservoir computing principles to create advanced computational models for studying neural dynamics and intelligence.",
    "Parameter Size": "Count of individual weights in a ML model that are learned from data during training.",
    "Wait Calculation": "Assessing whether to proceed with projects immediately or wait for future advancements in AI that could offer significant benefits.",
    "Verifier Theory": "Concept in computational complexity theory that focuses on the role of a verifier in determining the correctness of a solution to a problem within a given complexity class.",
    "Control Problem": "Challenge of ensuring that highly advanced AI systems act in alignment with human values and intentions.",
    "DPO (Direct Preference Optimization)": "ML technique used to optimize models based directly on user preferences rather than traditional loss functions.",
    "VQA (Visual Question Answering)": "Field of AI where systems are designed to answer questions about visual content, such as images or videos.",
    "Model Management": "Practices and technologies used to handle various lifecycle stages of machine learning models including development, deployment, monitoring, and maintenance.",
    "Model Drift": "Change in the underlying data patterns that a ML model was trained on, leading to a decrease in the model's accuracy and effectiveness over time.",
    "Red Teaming": "Practice where a team independently challenges a system, project, or policy to identify vulnerabilities, improve security, and test the effectiveness of defenses, often applied in cybersecurity and, increasingly, in AI safety and ethics.",
    "FSL (Few-Shot Learning)": "ML approach that enables models to learn and make accurate predictions from a very small dataset.",
    "Data Blending": "Process of combining data from multiple sources into a single, cohesive dataset for analysis.",
    "Saturating Non-Linearities": "Activation functions in neural networks that reach a point where their output changes very little, or not at all, in response to large input values.",
    "Foundation Model": "Type of large-scale pre-trained model that can be adapted to a wide range of tasks without needing to be trained from scratch each time.",
    "Fab": "A fabrication facility, or fab, is where microchips are manufactured using sophisticated processes involving advanced materials and photolithography.",
    "Natural Language": "Any language that has developed naturally among humans, used for everyday communication, such as English, Mandarin, or Spanish.",
    "TRL (Transfer Reinforcement Learning)": "Subfield of RL focused on leveraging knowledge gained from one or more source tasks to improve learning efficiency and performance in a different, but related, target task.",
    "Data Imputation": "Process of replacing missing or incomplete data within a dataset with substituted values to maintain the dataset's integrity and usability.",
    "Generative": "Subset of AI technologies capable of generating new content, ideas, or data that mimic human-like outputs.",
    "Actor-Critic Models": "Reinforcement learning architecture that includes two components: an actor that determines the actions to take and a critic that evaluates those actions to improve the policy.",
    "Control Logic": "Decision-making processes within a system that manage and dictate how various components respond to inputs, aiming to achieve desired outcomes or maintain specific conditions.",
    "Mixture Map": "Graphical representation used in data science and ML to visualize the relationships and interactions between different components or features of a dataset.",
    "Random Forest": "Robust ML algorithm that combines multiple decision trees to improve prediction accuracy and prevent overfitting.",
    "HMI (Human-Machine Interface)": "Hardware or software through which humans interact with machines, facilitating clear and effective communication between humans and computer systems.",
    "Causal Inference": "Process of determining the cause-and-effect relationship between variables.",
    "Recommendation Systems": "Algorithms designed to suggest relevant items to users (such as movies, books, products, etc.) based on their preferences and behaviors.",
    "MPC (Model-Predictive Control)": "Control algorithm that uses a model of the system to predict future states and optimizes control actions over a future time horizon.",
    "A-Life (Artificial Life)": "Studies the simulation of life processes within computers or synthetic systems to gain insights into biological phenomena.",
    "Symbolic Regression": "Type of regression analysis that searches for mathematical expressions to best fit a given set of data points.",
    "Parameter Space": "Multidimensional space defined by all possible values of the parameters of a model, often used in ML and optimization to explore different configurations that influence model performance.",
    "Feature Design": "Process of selecting, modifying, or creating new features from raw data to improve the performance of machine learning models.",
    "Implicit Reasoning": "Ability of a system to make inferences and draw conclusions that are not explicitly programmed or directly stated in the input data.",
    "Neural Network": "Computing system designed to simulate the way human brains analyze and process information, using a network of interconnected nodes that work together to solve specific problems.",
    "xLSTM": "Extended form of Long Short-Term Memory (LSTM), integrating enhancements for scalability and efficiency in DL models.",
    "Double Descent": "Phenomenon in ML where the prediction error on test data initially decreases, increases, and then decreases again as model complexity grows.",
    "EDA (Exploratory Data Analysis)": "Technique used to analyze data sets to summarize their main characteristics, often with visual methods, before applying more formal modeling.",
    "RLHF (Reinforcement Learning from Human Feedback)": "Technique that combines reinforcement learning (RL) with human feedback to guide the learning process towards desired outcomes.",
    "Differentiable Parametric Curves": "Mathematical curves described by parametric equations that are differentiable, meaning they have continuous derivatives.",
    "Wavelet": "Mathematical function used for analyzing localized variations of power within a time series or signal, providing a multi-resolution analysis.",
    "Hyperparameter Tuning": "Process of optimizing the parameters of a ML model that are not learned from data, aiming to improve model performance.",
    "Abliteration": "Technique that uncensors language models by removing alignment restrictions without requiring retraining.",
    "Prompt Injection": "Technique used to manipulate or influence the behavior of AI models by inserting specific commands or cues into the input prompt.",
    "Sovereign AI": "Hypothetical form of AI that operates independently with its own autonomy, potentially possessing the ability to make decisions and take actions without human intervention.",
    "Initialization": "Process of setting the initial values of the parameters (weights and biases) of a model before training begins.",
    "SVM (Support Vector Machine)": "Supervised ML model used primarily for classification and regression tasks, which finds the optimal hyperplane that best separates different classes in the data.",
    "MDO (Multidomain Operations)": "Strategic and tactical integration of capabilities across multiple domains—such as land, sea, air, space, and cyberspace—enabled and enhanced by artificial intelligence and advanced technologies.",
    "Orchestration": "Systematic coordination and management of various models, algorithms, and processes to efficiently execute complex tasks and workflows.",
    "Cognitive Flexibility": "Mental ability to switch between thinking about two different concepts, or to think about multiple concepts simultaneously.",
    "Dataset": "Collection of related data points organized in a structured format, often used for training and testing machine learning models.",
    "Comparative Advantage": "Strategic advantage that a particular AI model, system, or approach has over others in performing specific tasks more efficiently or effectively due to unique strengths or capabilities.",
    "Emergence": "Phenomenon where larger entities, patterns, and regularities arise through interactions among smaller or simpler entities that themselves do not exhibit such properties.",
    "Empathic AI": "AI systems designed to recognize, understand, and respond to human emotions in a nuanced and contextually appropriate manner.",
    "Sparsity": "Technique and principle of having models that utilize minimal data representation and processing, typically through zero or near-zero values.",
    "Promptocracy": "Theoretical governance model where decision-making is guided by AI-generated prompts based on large datasets and probabilistic models.",
    "PPO (Proximal Policy Optimization)": "RL algorithm that aims to balance ease of implementation, sample efficiency, and reliable performance by using a simpler but effective update method for policy optimization.",
    "JEST (Multimodal Contrastive Learning with Joint Example Selection)": "AI technique that enhances the learning of shared representations across different modalities by jointly selecting and leveraging relevant examples.",
    "Neurogenesis": "Process by which new neurons are formed in the brain.",
    "IO (Influence Operations)": "Strategic actions designed to affect the perceptions, attitudes, and behaviors of target audiences to achieve specific objectives.",
    "TTT (Test-Time Training)": "ML approach where the model adapts itself during the inference phase using auxiliary tasks and additional training data available at test time to improve performance.",
    "RAG (Retrieval-Augmented Generation)": "Combines the retrieval of informative documents from a large corpus with the generative capabilities of neural models to enhance language model responses with real-world knowledge.",
    "PQ (Product Quantization)": "Technique used in large-scale vector quantization for efficient similarity search and data compression by decomposing high-dimensional vectors into smaller sub-vectors and quantizing each sub-vector separately.",
    "EMT (Extended Mind Transformer)": "Transformer model architecture that integrates external memory systems to enhance the model's ability to handle long-range dependencies and maintain relevant information over extended inputs. This approach allows the transformer to \"extend its mind\" by attending to external memories dynamically, improving its performance on tasks that require long-term reasoning or context retention.",
    "Tensor": "Multi-dimensional array used in mathematics and computer science, serving as a fundamental data structure in neural networks for representing data and parameters.",
    "KL (Kullback–Leibler) Divergence": "Measure of how one probability distribution diverges from a second, reference probability distribution.",
    "Exascale": "Computing systems capable of performing at least one exaflop, or a billion billion (quintillion) calculations per second.",
    "GPT (Generative Pre-Trained Transformer)": "Type of neural network architecture that excels in generating human-like text based on the input it receives.",
    "SNN (Spiking Neural Network)": "Type of artificial neural network that mimics the way biological neural networks in the brain process information, using spikes of electrical activity to transmit and process information.",
    "Residual Connections": "DL architecture feature designed to help alleviate the vanishing gradient problem by allowing gradients to flow through a network more effectively.",
    "Guardrails": "Principles, policies, and technical measures implemented to ensure AI systems operate safely, ethically, and within regulatory and societal norms.",
    "Information Integration": "Process of combining data from different sources to provide a unified view.",
    "Data Wall": "Limitation faced when the available data becomes insufficient for further training or improving machine learning models.",
    "EM (Expectation-Maximization)": "Statistical technique used to find the maximum likelihood estimates of parameters in probabilistic models, specifically when the model depends on unobserved latent variables.",
    "World Model": "Internal representation that an AI system uses to simulate the environment it operates in, enabling prediction and decision-making based on those simulations.",
    "SSM (State-Space Model)": "Mathematical frameworks used to model dynamic systems by describing their states in space and how these states evolve over time under the influence of inputs, disturbances, and noise.",
    "Reranking": "Process in which an initial set of items retrieved by a search algorithm is resorted using a secondary criterion or algorithm to better match user expectations or specific criteria.",
    "Sparsability": "Ability of algorithms to effectively handle and process data matrices where most elements are zero (sparse), improving computational efficiency and memory usage.",
    "Speech Processing": "Technology that enables computers to recognize, interpret, and generate human speech.",
    "Autograd": "Automatic differentiation system embedded within various ML frameworks that facilitates the computation of gradients, which are crucial for optimizing models during training.",
    "CUDA (Compute Unified Device Architecture)": "Parallel computing platform and application programming interface (API) that allows software developers and software engineers to use a graphics processing unit (GPU) for general purpose processing.",
    "NLU (Natural Language Understanding)": "Subfield of NLP focused on enabling machines to understand and interpret human language in a way that is both meaningful and contextually relevant.",
    "Max Pooling": "Downsampling technique that reduces the dimensionality of input data by selecting the maximum value from a specified subset of the data.",
    "Supervision": "Use of labeled data to train ML models, guiding the learning process by providing input-output pairs.",
    "RLHF++": "Advanced form of RLFH (Reinforcement Learning from Human Feedback), a technique used in ML to enhance model performance by incorporating human feedback into the training process.",
    "Query Flock": "Method to manage and process multiple related queries simultaneously, improving efficiency and response time.",
    "Robustness": "Ability of an algorithm or model to deliver consistent and accurate results under varying operating conditions and input perturbations.",
    "Geometric Deep Learning": "Field of study that extends DL techniques to data that is structured as graphs, manifolds, or more general topological spaces.",
    "Transfer Learning": "ML method where a model developed for a task is reused as the starting point for a model on a second task, leveraging the knowledge gained from the first task to improve performance on the second.",
    "Natural Language Problem": "Challenges encountered in understanding, processing, or generating human language using computational methods.",
    "NHI (Non-Human Intelligence)": "Intelligence systems that operate independently of human intelligence, encompassing a broad range of entities and origins, emphasizing capabilities that may surpass human cognitive processes.",
    "Byte-Level State Space": "Representation of the state space of a system or model at the granularity of individual bytes, capturing every possible state a byte can assume within a computational context.",
    "Hebbian Learning": "Neural network learning rule based on the principle that synapses between neurons are strengthened when the neurons activate simultaneously.",
    "Teacher Committee": "Group of expert models that collaboratively guide the training process of a student model to improve its performance.",
    "Data Mining": "Extracting valuable information from large datasets to identify patterns, trends, and relationships that may not be immediately apparent.",
    "MTL (Multi-Task Learning)": "ML approach where a single model is trained simultaneously on multiple related tasks, leveraging commonalities and differences across tasks to improve generalization.",
    "Autoencoder": "Type of artificial neural network used to learn efficient codings of unlabeled data, typically for the purpose of dimensionality reduction or feature learning.",
    "Active Inference": "Theoretical framework in neuroscience and artificial intelligence that describes how agents infer and act to minimize their prediction errors about the state of the world.",
    "Cross-Domain Competency": "Ability of an AI system to understand, learn, and apply knowledge and skills across multiple, varied domains or areas of expertise.",
    "Meta-Learning": "Learning to learn involves techniques that enable AI models to learn how to adapt quickly to new tasks with minimal data.",
    "Few Shot": "ML technique designed to recognize patterns and make predictions based on a very limited amount of training data.",
    "Dimensionality Reduction": "Process used in ML to reduce the number of input variables or features in a dataset, simplifying models while retaining essential information.",
    "Inverse Problems": "Determining the underlying causes or parameters from observed data, essentially reversing the usual process of predicting effects from known causes.",
    "Polymorphism": "Ability of objects to take on many forms, allowing methods to perform differently based on the object that invokes them.",
    "Affective Computation": "Field within AI that focuses on the design of systems and devices capable of recognizing, interpreting, processing, and simulating human emotions.",
    "Human-Level AI": "AI systems that can perform any intellectual task with the same proficiency as a human being.",
    "BNNs (Biological Neural Networks)": "Complex networks of neurons found in biological organisms, responsible for processing and transmitting information through electrical and chemical signals.",
    "Training": "Process of teaching a ML model to make accurate predictions or decisions, by adjusting its parameters based on data.",
    "Heuristic Search Techniques": "Methods used in AI to find solutions or make decisions more efficiently by using rules of thumb or informed guesses to guide the search process.",
    "Flash Attention": "GPU-optimized attention mechanism designed to efficiently handle extremely large sequences of data in neural networks.",
    "Narrow AI": "Also known as Weak AI, refers to AI systems designed to perform a specific task or a narrow range of tasks with a high level of proficiency.",
    "Polymathic AI": "AI systems that possess a wide range of skills and knowledge, enabling them to perform tasks across various domains, much like a human polymath.",
    "Hessian Matrix": "Square matrix of second-order partial derivatives of a scalar-valued function, crucial in optimization, particularly for understanding the curvature of multidimensional functions.",
    "AlexNet": "Deep convolutional neural network that significantly advanced the field of computer vision by winning the ImageNet Large Scale Visual Recognition Challenge in 2012.",
    "Discriminator": "Model that determines the likelihood of a given input being real or fake, typically used in generative adversarial networks (GANs).",
    "System 1 & System 2": "Two modes of thinking in human cognition: System 1 is fast, automatic, and intuitive, while System 2 is slow, deliberate, and analytical.",
    "MLP (Multilayer Perceptron)": "Type of artificial neural network comprised of multiple layers of neurons, with each layer fully connected to the next, commonly used for tasks involving classification and regression.",
    "Logistic Regression": "Statistical model that estimates the probability of a binary outcome, commonly used for classification tasks.",
    "Parameterized": "Model or function in AI that utilizes parameters to make predictions or decisions.",
    "Exponential Slope Blindness": "Human cognitive bias that makes it difficult to perceive and understand the implications of exponential growth accurately.",
    "SoftMax": "Function that converts a vector of numerical values into a vector of probabilities, where the probabilities of each value are proportional to the exponentials of the input numbers.",
    "ASR (Automatic Speech Recognition)": "Translates spoken language into written text, enabling computers to understand and process human speech.",
    "Compute Efficiency": "Effective use of computational resources to maximize performance and minimize waste.",
    "AV (Autonomous Vehicles)": "Self-driving cars that combine sensors, algorithms, and software to navigate and drive without human intervention.",
    "Brute Force": "Straightforward problem-solving approach that systematically enumerates all possible candidates to find a solution.",
    "Negative Utilitarianism": "Ethical theory that prioritizes minimizing suffering and negative experiences over maximizing happiness and positive experiences.",
    "Fourier Analysis": "Mathematical method for decomposing functions or signals into their constituent frequencies.",
    "Panel-of-Experts": "Decision-making system where multiple experts provide their opinions or solutions, and the consensus or most supported option is chosen.",
    "Phase Transition": "Critical point where a small change in a parameter or condition causes a significant shift in the system's behavior or performance.",
    "Regularization": "Technique used in machine learning to reduce model overfitting by adding a penalty to the loss function based on the complexity of the model.",
    "Dual Use Foundational Model": "AI systems designed for general purposes that can be adapted for both beneficial and potentially harmful applications.",
    "Policy-Guided Diffusion": "Method where a policy, typically learned via RL, guides the diffusion process in generating samples that conform to desired specifications or constraints.",
    "GPU-Poor": "Scenario where there is a lack of adequate GPU resources available for computational tasks.",
    "AI Watchdog": "Organizations, frameworks, or systems designed to monitor, regulate, and guide the development and deployment of artificial intelligence technologies to ensure they adhere to ethical standards, legal requirements, and societal expectations.",
    "TTFT (Test Time Fine-Tuning)": "Process of adapting a pre-trained model using new data during the testing phase to improve its performance on specific tasks.",
    "Attention Block": "Core component in neural networks, particularly in transformers, designed to selectively focus on the most relevant parts of an input sequence when making predictions.",
    "FSA (Finite State Automata)": "Computational model that processes input sequences and transitions between a finite number of states according to a set of rules, typically used for recognizing patterns or designing digital circuits.",
    "Conditional Probability": "Measures the likelihood of an event occurring, given that another event has already occurred.",
    "DNC (Differential Neural Computer)": "Advanced type of artificial neural network that integrates an external memory module, enabling it to store and retrieve information similar to a computer, enhancing its capability to solve complex tasks requiring long-term dependencies.",
    "Hidden Layer": "Layer of neurons in an artificial neural network that processes inputs from the previous layer, transforming the data before passing it on to the next layer, without direct exposure to the input or output data.",
    "Parallelism": "Simultaneous execution of multiple processes or tasks to improve performance and efficiency.",
    "Attention Matrix": "Component in attention mechanisms of neural networks that determines the importance of each element in a sequence relative to others, allowing the model to focus on relevant parts of the input when generating outputs.",
    "Alignment Platform": "Framework designed to ensure that AI operates in ways that are aligned with human values, ethics, and objectives.",
    "Vanishing Gradient": "Phenomenon in neural networks where gradients of the network's parameters become very small, effectively preventing the weights from changing their values during training.",
    "TF-IDF (Term Frequency-Inverse Document Frequency)": "Numerical statistic used to evaluate the importance of a word within a document relative to a collection of documents.",
    "P-hacking": "Manipulation of data analysis to achieve statistically significant results, often by repeatedly testing different variables or subsets of data until desirable outcomes are found.",
    "Instantiation": "Process of creating a specific instance of an abstract concept, algorithm, or data structure, allowing for its practical use and application.",
    "NLD (Neural Lie Detectors)": "AI systems designed to identify dishonesty or inconsistencies in the outputs or decisions of other AI models by analyzing their responses or behavior.",
    "Adversarial Debiasing": "ML technique aimed at reducing bias in models by using adversarial training, where one network tries to predict sensitive attributes and another tries to prevent it.",
    "Backpropagation": "Algorithm used for training artificial neural networks, crucial for optimizing the weights to minimize error between predicted and actual outcomes.",
    "Generative Workflow": "Process of using AI to automatically create content, such as text, images, or music, based on learned patterns from data.",
    "FCN (Fully Convolutional Networks)": "Neural network architecture designed specifically for image segmentation tasks, where the goal is to classify each pixel of an image into a category.",
    "Deterministic Quoting": "Method ensuring that AI-generated quotations from source materials are verbatim and not subject to AI-induced hallucinations.",
    "Discount Factor": "Multiplicative factor used to reduce future values or rewards to their present value in decision-making processes, particularly in reinforcement learning.",
    "Superintelligence": "A form of AI that surpasses the cognitive performance of humans in virtually all domains of interest, including creativity, general wisdom, and problem-solving.",
    "Neuroevolution": "AI approach that uses evolutionary algorithms to develop and optimize artificial neural networks.",
    "Self-Supervised Pretraining": "ML approach where a model learns to predict parts of the input data from other parts without requiring labeled data, which is then fine-tuned on downstream tasks.",
    "Volumetric AI": "AI techniques to process, analyze, and generate three-dimensional volumetric data, often used in fields like medical imaging, 3D reconstruction, and virtual reality.",
    "QA (Question-Answer)": "Tools designed to provide precise answers to user queries by understanding and processing natural language inputs.",
    "Reflective Programming": "Programming paradigm that allows a program to inspect and modify its own structure and behavior at runtime.",
    "Unhobbling": "Process of unlocking latent capabilities in AI models by addressing limitations and inefficiencies, thus significantly enhancing their practical utility.",
    "CLIP (Contrastive Language–Image Pre-training)": "Machine learning model developed by OpenAI that learns visual concepts from natural language descriptions, enabling it to understand images in a manner aligned with textual descriptions.",
    "DAG (Directed Acyclic Graphs)": "Graph that consists of vertices connected by edges, with the directionality from one vertex to another and no possibility of forming a cycle.",
    "Rightsizing": "Adjusting the computational resources allocated to AI systems to match the workload requirements optimally.",
    "AGI (Artificial General Intelligence)": "AI capable of understanding, learning, and applying knowledge across a wide range of tasks, matching or surpassing human intelligence.",
    "XAI (Explainable AI)": "AI systems designed to provide insights into their behavior and decisions, making them transparent and understandable to humans.",
    "DoLa (Decoding by Contrasting Layers)": "Novel method for enhancing language model performance by focusing on contrasting the outputs of different layers to improve decoding accuracy.",
    "Reasoning Path": "Logical steps or sequence of inferences made by an AI model or system to arrive at a conclusion, decision, or solution.",
    "Compute": "Processing power and resources required to run AI algorithms and models.",
    "TRPO (Trust Region Policy Optimization)": "Advanced algorithm used in RL to ensure stable and reliable policy updates by optimizing within a trust region, thus preventing drastic policy changes.",
    "Sequence Masking": "ML technique to prevent certain parts of input sequences from influencing the training process of models, particularly in natural language processing tasks.",
    "Feature Importance": "Techniques used to identify and rank the significance of input variables (features) in contributing to the predictive power of a ML model.",
    "Neurosymbolic AI": "Integration of neural networks with symbolic AI to create systems that can both understand and manipulate symbols in a manner similar to human cognitive processes.",
    "Training Cost": "Quantifies the resources required to develop AI models, including computational expenses, energy consumption, and human expertise.",
    "Cybernetics": "Interdisciplinary study of control and communication in living organisms and machines.",
    "Hypernetwork": "Neural network that generates the weights for another neural network, enabling dynamic adaptation and increased flexibility in learning and generalization.",
    "Distillation": "Process of compressing a larger, complex model (the teacher) into a smaller, simpler model (the student) while retaining much of the original model's performance.",
    "Inductive Prior": "Set of assumptions or biases that a ML model uses to infer patterns from data and make predictions, effectively guiding the learning process based on prior knowledge or expected behavior.",
    "Adversarial Instructions": "Inputs designed to deceive AI models into making incorrect predictions or decisions, highlighting vulnerabilities in their learning algorithms.",
    "Dimension": "Number of features or attributes that represent a data point in a vector space.",
    "P(Doom)": "Probability of an existential catastrophe, often discussed within the context of AI safety and risk assessment.",
    "ResNet (Residual Network)": "Type of CNN (Convolutional Neural Network) architecture that introduces residual learning to facilitate the training of much deeper networks by utilizing shortcut connections or skip connections that allow the gradient to bypass some layers.",
    "Algorithmic Bias": "Systematic and unfair discrimination embedded in the outcomes of algorithms, often reflecting prejudices present in the training data or design process.",
    "DTW (Dynamic Time Warping)": "Algorithm used to measure similarity between two time series by aligning them in a nonlinear fashion, allowing for comparisons even when there are shifts and distortions in time.",
    "MMLU (Massive Multitask Language Understanding)": "Evaluation framework designed to assess the performance of language models across a broad spectrum of tasks and domains.",
    "Linear Complexity": "Situation where the time or space required to solve a problem increases linearly with the size of the input.",
    "Abductive Reasoning": "Form of logical inference that starts with an observation and seeks the simplest and most likely explanation for it.",
    "Symbolic AI": "Also known as \"Good Old-Fashioned AI\" (GOFAI), involves the manipulation of symbols to represent problems and compute solutions through rules.",
    "IR (Information Retrieval)": "Process of obtaining relevant information from a large repository based on user queries.",
    "Chinchilla Scaling": "Strategy in training LLMs that optimizes the ratio of model size to training data size.",
    "Gating Mechanism": "Control function that regulates the flow of information through the model, deciding what information to keep, discard, or update.",
    "Dual Use": "Technologies developed for civilian purposes that can also be repurposed for military or malicious applications, highlighting ethical considerations in their development and regulation.",
    "Memory Systems": "Mechanisms and structures designed to store, manage, and recall information, enabling machines to learn from past experiences and perform complex tasks.",
    "VC Dimension (Vapnik-Chervonenkis)": "Measure of the capacity of a statistical classification algorithm, quantifying how complex the model is in terms of its ability to fit varied sets of data.",
    "State Space Model": "Mathematical frameworks used to represent systems that are governed by a set of latent (hidden) variables evolving over time, observed through another set of variables.",
    "Stateful": "System or application that saves client data from previous sessions to influence and personalize future interactions.",
    "Diffusion Forcing": "Intentional manipulation of diffusion models to guide the generation of data towards desired outcomes.",
    "Active Externalism": "Theory that cognitive processes can extend beyond the human mind to include external devices or environments as integral components of thinking.",
    "LoRA (Low-Rank Adaptation)": "Technique for fine-tuning LLMs in a parameter-efficient manner.",
    "Machine Understanding": "Capability of AI systems to interpret and comprehend data, text, images, or situations in a manner akin to human understanding.",
    "Goal": "Desired outcome or objective that an AI system is programmed to achieve.",
    "Imitation Learning": "AI technique where models learn to perform tasks by mimicking human behavior or strategies demonstrated in training data.",
    "Router": "Mechanism that directs queries to the most suitable model or sub-component within a multi-model or multi-component architecture to optimize performance and accuracy.",
    "Supervised Classifier": "Algorithm that, given a set of labeled training data, learns to predict the labels of new, unseen data.",
    "ANN (Artificial Neural Networks)": "Computing systems inspired by the biological neural networks that constitute animal brains, designed to progressively improve their performance on tasks by considering examples.",
    "Hallucination": "Generation of inaccurate, fabricated, or irrelevant output by a model, not grounded in the input data or reality.",
    "Co-Pilot": "System designed to assist humans in various tasks by offering suggestions, automating routine tasks, and enhancing decision-making processes.",
    "Accelerator": "Hardware designed to speed up specific types of computations, such as those needed for AI model training and inference.",
    "Generative AI": "Subset of AI technologies that can generate new content, ranging from text and images to music and code, based on learned patterns and data.",
    "SIL (Simulator in the Loop)": "Methodology in which a simulator is integrated into the control loop of a system, providing a virtual environment for real-time testing and validation of algorithms, control strategies, or system performance.",
    "Policy Learning": "Branch of reinforcement learning where the objective is to find an optimal policy that dictates the best action to take in various states to maximize cumulative reward.",
    "Counterfactual Explanations": "Statements or scenarios that explain how a different outcome could have been achieved by altering specific inputs or conditions in an AI system.",
    "Prompt": "User-generated input or question designed to elicit a specific response or output from the model.",
    "Dropout": "Regularization technique used in neural networks to prevent overfitting by randomly omitting a subset of neurons during training.",
    "Kaggle Effect": "Phenomenon where ML models developed on Kaggle competitions perform well on specific datasets but may not generalize as effectively to real-world applications due to the unique constraints and optimizations used in these competitions.",
    "MDPO (Mirror Descent Policy Optimization)": "Optimization algorithm used in reinforcement learning to update policies by leveraging the mirror descent technique, which balances exploration and exploitation more effectively than traditional gradient descent methods.",
    "Stochastic Parrot": "Language models that generate text based on probabilistic predictions, often criticized for parroting information without understanding.",
    "MDL (Minimum Description Length)": "Principle formalization of Occam's Razor in information theory, advocating that the best hypothesis for a given set of data is the one that leads to the shortest total description of the data and the hypothesis.",
    "Image Synthesis": "Use of AI models to generate new, unique images based on learned patterns and features from a dataset.",
    "Anomaly Detection": "Process of identifying unusual patterns that deviate from expected behavior, often used to detect fraud, network intrusions, or unusual transactions.",
    "Training Data": "Dataset used to teach a ML model how to make predictions or perform tasks.",
    "Chatbot": "Software application designed to simulate conversation with human users, often over the Internet.",
    "NIAN (Needle in a Needlestack)": "Idiom used to describe the difficulty of finding a specific piece of information or data within a vast, but homogeneous, dataset.",
    "In-Context Learning": "Method where an AI model uses the context provided in a prompt to guide its responses without additional external training.",
    "Explainability": "Ability of a system to transparently convey how it arrived at a decision, making its operations understandable to humans.",
    "Triple": "Data structure in the form of a three-part entity consisting of a subject, predicate, and object, commonly used in semantic web technologies and knowledge graphs.",
    "TCN (Temporal Convolutional Networks)": "Type of neural network designed to handle sequential data by applying convolutional operations over time.",
    "Salience": "Quality by which certain aspects of a dataset or information stand out as particularly noticeable or important in a given context.",
    "Point-wise Feedforward Network": "Neural network layer that applies a series of linear and non-linear transformations to each position (or \"point\") in the input sequence independently.",
    "Parameter": "Variable that is internal to the model and whose value is estimated from the training data.",
    "MRL (Matryoshka Representation Learning)": "ML approach under the umbrella of representation learning, which aims to construct hierarchical representations of data, akin to the nesting structure of Russian matryoshka dolls.",
    "Output Verifier": "Mechanism used to confirm that the output of a system, particularly in software or hardware systems, matches the expected results, ensuring accuracy and correctness.",
    "Matrix Models": "Mathematical frameworks that use matrices with parameters to represent and solve complex problems, often in ML, statistics, and systems theory.",
    "Nationalization": "Government's takeover or control of AI technology and assets, typically to secure national interests, enhance regulatory oversight, or maintain sovereignty over critical technological infrastructure.",
    "Safety Net": "Measures, policies, and technologies designed to prevent, detect, and mitigate adverse outcomes or ethical issues stemming from AI systems' operation.",
    "FPGA (Field-Programmable Gate Array)": "Type of integrated circuit that can be configured by the customer or designer after manufacturing.",
    "Solomonoff Induction": "Theory of prediction that combines elements of algorithmic information theory and Bayesian inference to create a universal framework for inferring future data from past observations.",
    "Local Weight Sharing": "Technique where the same weights are used across different positions in an input, enhancing the network's ability to recognize patterns irrespective of their spatial location.",
    "Policy Parameters": "Variables in a ML model, particularly in RL, that define the behavior of the policy by determining the actions an agent takes in different states.",
    "Contrastive Learning": "ML technique used primarily in unsupervised learning that improves model performance by teaching the model to distinguish between similar and dissimilar data points.",
    "Path Integration": "Computational process by which an agent estimates its current position based on its previous position and the path it has taken, using internal cues rather than external landmarks.",
    "Streaming": "Continuous generation and delivery of text in real-time as the model processes input sequentially.",
    "SIMA (Scalable Instructable Multiworld Agent)": "AI agent designed to operate across multiple 3D virtual environments, following natural language instructions to accomplish varied tasks.",
    "Neuromorphic Chips": "Specialized hardware designed to mimic the neural structures and functioning of the human brain to enhance computational efficiency and speed in processing AI algorithms.",
    "RNN (Recurrent Neural Network)": "Class of neural networks where connections between nodes form a directed graph along a temporal sequence, enabling them to exhibit temporal dynamic behavior for a sequence of inputs.",
    "Layer Normalization": "Technique used in neural networks to normalize the inputs across the features within a layer, improving training stability and model performance, particularly in recurrent and transformer models.",
    "GLU (Gated Linear Unit)": "Neural network component that uses a gating mechanism to control information flow, improving model efficiency and performance.",
    "BERT (Bidirectional Encoder Representations from Transformers)": "Deep Learning model for NLP that significantly improves the understanding of context and the meaning of words in sentences by analyzing text bidirectionally.",
    "Discriminative AI": "Algorithms that learn the boundary between classes of data, focusing on distinguishing between different outputs given an input.",
    "Cosine Similarity": "Measures the cosine of the angle between two vectors in a multidimensional space, often used to determine how similar two items are.",
    "Multi-headed Attention": "Mechanism in neural networks that allows the model to jointly attend to information from different representation subspaces at different positions.",
    "Autocomplete": "Feature in software applications that predicts and suggests possible completions for a user’s input, such as text or code, based on partial input data.",
    "GOFAI (Good Old-Fashioned AI)": "Traditional approach to AI that relies on symbolic reasoning, logic, and rule-based systems to simulate intelligent behavior.",
    "Conditional Generation": "Process where models produce output based on specified conditions or constraints.",
    "DNN (Deep Neural Networks)": "Advanced neural network architectures with multiple  layers that enable complex pattern recognition and learning from large amounts of data.",
    "Turing Complete": "System capable of simulating any Turing machine, thereby performing arbitrary computational operations given enough time and resources.",
    "TTS (Text-to-Speech)": "Converts written text into spoken voice output, enabling computers to read text aloud.",
    "Stacking": "ML ensemble technique that combines multiple classification or regression models via a meta-classifier or meta-regressor to improve prediction accuracy.",
    "Straight-Through Estimator": "Technique used in training neural networks to enable the backpropagation of gradients through non-differentiable functions or operations.",
    "Cognitive Architecture": "A theory or model that outlines the underlying structure and mechanisms of the human mind or AI systems, guiding the integration of various cognitive processes.",
    "Traceability": "Ability to track and document the origins, evolution, and interactions of data, models, and decisions throughout the AI lifecycle.",
    "Log Likelihood": "Logarithm of the likelihood function, used in statistical models to measure how well a model explains a given set of data.",
    "Transposed Convolutional Layer": "Type of neural network layer that performs the opposite operation of a traditional convolutional layer, effectively upscaling input feature maps to a larger spatial resolution.",
    "One-Shot Learning": "ML technique where a model learns information about object categories from a single training example.",
    "Attention Pattern": "Mechanism that selectively focuses on certain parts of the input data to improve processing efficiency and performance outcomes.",
    "Cherry Picking": "Practice of selectively choosing the most favorable results from multiple outputs generated by an algorithm, often used to present the algorithm in a better light.",
    "Embedding Space": "Mathematical representation where high-dimensional vectors of data points, such as text, images, or other complex data types, are transformed into a lower-dimensional space that captures their essential properties.",
    "EDL (Experimentation Driven Learning)": "AI approach where learning algorithms improve their performance through systematic experimentation and feedback from the environment.",
    "Frame Problem": "Challenge in AI of representing and updating the effects of actions in a dynamic world without having to explicitly state all conditions that remain unchanged.",
    "Objective Function": "Objective function used in ML which quantitatively defines the goal of an optimization problem by measuring the performance of a model or solution.",
    "Static Inference": "Process of performing predictions using a pre-trained machine learning model without updating the model parameters during runtime.",
    "ACI (Agent-Computer Interface)": "Systems and methods that enable interactive communication between autonomous agents and computer programs.",
    "Adaptive Problem Solving": "The capacity of AI systems to modify their approaches to problem-solving based on new data, feedback, or changing environments, enhancing their efficiency and effectiveness over time.",
    "Effective Accelerationism": "Ideology that encourages the rapid advancement of technology, especially AI, to address global challenges and accelerate progress towards a technologically advanced future.",
    "Benchmark": "Standard or set of standards used to measure and compare the performance of algorithms, models, or systems.",
    "God in a Box": "AI systems or models that are so powerful and advanced that they could theoretically solve any problem or fulfill any command, but are contained within strict controls to prevent unintended consequences.",
    "Vectorization": "Process of converting non-numeric data into numeric format so that it can be used by ML algorithms.",
    "LMN (Large Nature Model)": "Open-source model focused on nature, using a vast, ethically sourced dataset of natural world elements.",
    "ControlNet": "Neural network architecture designed to add spatial conditioning controls to diffusion models, enabling precise manipulation without altering the original model's integrity.",
    "Latent Space": "Abstract, multi-dimensional representation of data where similar items are mapped close together, commonly used in ML and AI models.",
    "PPML (Privacy-Preserving Machine Learning)": "Techniques that protect user data privacy during the machine learning process, without compromising the utility of the models.",
    "LAM (Large Action Model)": "Advanced AI systems designed to interpret and execute complex tasks by directly modeling human actions within digital applications.",
    "SAM (Segment Anything Model)": "AI model designed for high-precision image segmentation, capable of identifying and delineating every object within an image.",
    "Gradient Descent": "Optimization algorithm used to find the minimum of a function by iteratively moving towards the steepest descent direction.",
    "Instruction-Following": "Ability to accurately understand and execute tasks based on given directives.",
    "ReAct (Reason+Act)": "AI framework for integrating reasoning and acting capabilities, enabling models to make decisions based on both logic and learned actions.",
    "PFGM (Poisson Flow Generative Model)": "Generative model that utilizes Poisson processes in its architecture to model and generate complex data distributions.",
    "Inference Acceleration": "Methods and hardware optimizations employed to increase the speed and efficiency of the inference process in machine learning models, particularly neural networks.",
    "Siamese Network": "Type of neural network architecture that involves two or more identical subnetworks sharing the same parameters and weights, typically used for tasks like similarity learning and verification.",
    "Categorical Deep Learning": "Application of DL techniques to analyze and predict categorical data, which includes discrete and typically non-numeric values that represent categories or classes.",
    "Overhang": "Disparity between the minimum computation needed for a certain performance level and the actual computation used in training a model, often leading to superior model performance.",
    "BCI (Brain Computer Interface)": "Enables direct communication pathways between the brain and external devices, allowing for control of computers or prosthetics with neural activity.",
    "Positional Encoding": "Technique used in neural network models, especially in transformers, to inject information about the order of tokens in the input sequence.",
    "Clustering": "Unsupervised learning method used to group a set of objects in such a way that objects in the same group (called a cluster) are more similar to each other than to those in other groups.",
    "Uncensored AI": "AI systems that operate without restrictions on the content they generate or the decisions they make.",
    "NeRF (Neural Radiance Fields)": "Technique for creating high-quality 3D models from a set of 2D images using deep learning.",
    "GIGO (Garbage In, Garbage Out)": "Concept that emphasizes the quality of output is determined by the quality of input data.",
    "CLI (Command Line Interface)": "Text-based user interface used to interact with software or operating systems through commands, rather than graphical elements.",
    "Token": "Basic unit of data processed in NLP tasks, representing words, characters, or subwords.",
    "Multi-Token Prediction": "AI technique used in NLP where a model generates multiple output tokens simultaneously, often improving coherence and speed compared to single-token generation methods.",
    "Autoregressive Generation": "Method where the prediction of the next output in a sequence is based on the previously generated outputs.",
    "Text to Action": "Process of interpreting and converting written or spoken language into executable actions by a system or application.",
    "Regime": "Distinct operational or behavioral mode in which an AI system functions, characterized by specific patterns or properties of data, parameters, or algorithms.",
    "AI Effect": "Phenomenon where once an AI system can perform a task previously thought to require human intelligence, the task is no longer considered to be a benchmark for intelligence.",
    "Convolution": "Mathematical operation used in signal processing and image processing to combine two functions, resulting in a third function that represents how one function modifies the other.",
    "Convergence": "The point at which an algorithm or learning process stabilizes, reaching a state where further iterations or data input do not significantly alter its outcome.",
    "Composability": "Design feature in software systems that allows different components to be selected and assembled in various combinations to satisfy specific user requirements.",
    "Loss Optimization": "Process of adjusting a model's parameters to minimize the difference between the predicted outputs and the actual outputs, measured by a loss function.",
    "Image Recognition": "Ability of AI to identify objects, places, people, writing, and actions in images.",
    "Translational": "Process or approach of converting scientific research into practical applications.",
    "NLP (Natural Language Processing)": "Field of AI that focuses on the interaction between computers and humans through natural language.",
    "WBE (Whole Brain Emulation)": "Hypothetical process of scanning a biological brain in detail and replicating its state and processes in a computational system to achieve functional and experiential equivalence.",
    "Naive Bayesian Model": "Probabilistic classifier that assumes strong (naive) independence between the features of a dataset.",
    "Reward Model Ensemble": "Combination of multiple reward models used together to evaluate and guide the learning process of reinforcement learning agents, aiming to improve robustness, accuracy, and generalization of the reward signal.",
    "Data Augmentation": "Techniques used to increase the size and improve the quality of training datasets for machine learning models without collecting new data.",
    "Group-Based Alignment": "Process of coordinating multiple AI systems or agents to work together harmoniously, ensuring their actions align with shared goals and values.",
    "Classifier": "ML model that categorizes data into predefined classes.",
    "Spillover": "Unintended consequences or effects that AI systems can have outside of their designed operational contexts.",
    "Bayesian Network": "Graphical model that represents probabilistic relationships among variables using directed acyclic graphs (DAGs).",
    "Regression": "Statistical method used in ML to predict a continuous outcome variable based on one or more predictor variables.",
    "Exocortex": "External artificial extension of the human brain, designed to augment cognitive functions through advanced computing technologies.",
    "MatMul (Matrix Multiplication)": "Fundamental operation in linear algebra and essential in various applications, including neural networks and machine learning algorithms.",
    "Self-Correction": "An AI system's ability to recognize and rectify its own mistakes or errors without external intervention.",
    "Optimization Problem": "Optimization problem in AI which involves finding the best solution from all feasible solutions, given a set of constraints and an objective to achieve or optimize.",
    "Bias-Variance Dilemma": "Fundamental problem in supervised ML that involves a trade-off between a model’s ability to minimize error due to bias and error due to variance.",
    "Vector Database": "Specialized database optimized for storing and querying vectors, which are arrays of numbers representing data in high-dimensional space.",
    "Alignment": "Process of ensuring that an AI system's goals and behaviors are consistent with human values and ethics.",
    "Occam's Razor": "Principle that, among competing models with similar predictive power, the simplest one should be chosen.",
    "Jagged Frontier": "Metaphorically describes an area of AI research characterized by rapid, uneven advances and significant uncertainties or complexities.",
    "Classification": "Supervised learning task in ML where the goal is to assign input data to one of several predefined categories.",
    "Embedding": "Representations of items, like words, sentences, or objects, in a continuous vector space, facilitating their quantitative comparison and manipulation by AI models.",
    "Synthetic Data Generation": "Creating artificial data programmatically, often used to train ML models where real data is scarce, sensitive, or biased.",
    "GAN (Generative Adversarial Network)": "Class of AI algorithms used in unsupervised ML, implemented by a system of two neural networks contesting with each other in a game.",
    "Flexible Semantics": "Ability of a system to adapt and interpret meaning in a dynamic, context-sensitive manner, particularly within language processing and understanding.",
    "Function Approximation": "Method used in AI to estimate complex functions using simpler, computationally efficient models.",
    "Negative Feedback": "Control mechanism where the output of a system is fed back into the system in a way that counteracts fluctuations from a setpoint, thereby promoting stability.",
    "MLM (Masked-Language Modeling)": "Training technique where random words in a sentence are replaced with a special token, and the model learns to predict these masked words based on their context.",
    "Interpretability": "Extent to which a human can understand the cause of a decision made by an AI system.",
    "Brainoware": "AI systems designed to emulate the functions and processes of the human brain, focusing on cognitive and neural-inspired computing.",
    "Mixture Model": "Probabilistic model that assumes that the data is generated from a mixture of several distributions, each representing a different subpopulation within the overall population.",
    "k-NN (k-Nearest Neighbors)": "Simple, non-parametric algorithm used in ML for classification and regression tasks by assigning labels based on the majority vote of the nearest neighbors.",
    "Denoising": "Process of removing noise from data, particularly in the context of images and signals, to enhance the quality of the information.",
    "Black Box": "System or model whose internal workings are not visible or understandable to the user, only the input and output are known.",
    "Model Collapse": "Phenomenon where a ML model, particularly in unsupervised or generative learning, repeatedly produces identical or highly similar outputs despite varying inputs, leading to a loss of diversity in the generated data.",
    "Toy Program": "Simple, small-scale software application created primarily for educational purposes, testing, or proof of concept rather than for real-world use.",
    "VLM (Visual Language Model)": "AI models designed to interpret and generate content by integrating visual and textual information, enabling them to perform tasks like image captioning, visual question answering, and more.",
    "Inductive Reasoning": "Logical process where specific observations or instances are used to form broader generalizations and theories.",
    "Connectionist AI": "Set of computational models in AI that simulate the human brain's network of neurons to process information and learn from data.",
    "Agent-to-Agent Interaction": "Communication and cooperation between autonomous agents within a multi-agent system to achieve individual or collective goals.",
    "Persuasive System": "Type of software designed to change a person's attitude or behavior through persuasion and social influence.",
    "Deterministic": "System or process is one that, given a particular initial state, will always produce the same output or result, with no randomness or unpredictability involved.",
    "Contextual Embedding": "Vector representations of words or tokens in a sentence that capture their meanings based on the surrounding context, enabling dynamic and context-sensitive understanding of language.",
    "A-B Testing": "Method used to compare two versions of a variable to determine which one performs better in achieving a specific outcome.",
    "Hierarchical Planning": "Approach to solving complex problems by breaking them down into more manageable sub-problems, organizing these into a hierarchy.",
    "Lost-in-the-Middle": "Issue in LLMs where they tend to struggle with retaining and processing information from the middle parts of long input sequences.",
    "Incidental Polysemanticity": "Phenomenon where a neural network, particularly in large language models, learns to associate multiple meanings or interpretations with a single internal representation or neuron, often without explicit instruction.",
    "Non-Contrastive": "ML approach that focuses on learning useful representations of data without explicitly contrasting positive examples against negative examples.",
    "Cognitive Computing": "Computer systems that simulate human thought processes to solve complex problems.",
    "Pretrained Model": "ML model that has been previously trained on a large dataset and can be fine-tuned or used as is for similar tasks or applications.",
    "Performance Degradation": "Decline in the efficiency or effectiveness of an AI system over time or under specific conditions, leading to reduced accuracy, speed, or reliability.",
    "Full-Sequence Diffusion": "Approach in diffusion models where the entire sequence of data undergoes the diffusion process simultaneously rather than segment by segment.",
    "Computational Creativity": "The study and building of software and algorithms that exhibit behaviors deemed creative in humans, such as generating original artwork, music, or solving problems in unique ways.",
    "Attestation": "Process of verifying the integrity and authenticity of hardware, software, or data.",
    "Overfitting": "When a ML model learns the detail and noise in the training data to the extent that it negatively impacts the performance of the model on new data.",
    "MAS (Multi-Agent Systems)": "Systems in which multiple autonomous agents interact with each other within a shared environment to achieve individual or collective goals.",
    "Expressive Hidden States": "internal representations within a neural network that effectively capture and encode complex patterns and dependencies in the input data.",
    "Intelligence Explosion": "Hypothetical scenario where an AI system rapidly improves its own capabilities and intelligence, leading to a superintelligent AI far surpassing human intelligence.",
    "Syntactic Templates": "Predefined structures that define the permissible syntax patterns for sentences in natural language processing (NLP) to facilitate parsing and generation tasks.",
    "Shared Awareness": "Collective understanding and perception of information among multiple agents, both human and machine, in a given environment.",
    "Memory Extender": "Techniques or systems designed to enhance the memory capabilities of AI models, enabling them to retain and utilize more information over longer periods.",
    "Biocomputer": "Computational system that uses biological molecules, such as DNA and proteins, to perform data processing and storage tasks.",
    "RBMs (Restricted Boltzmann Machines)": "Type of generative stochastic artificial neural network that can learn a probability distribution over its set of inputs.",
    "Association Rule": "Method in data mining for discovering interesting relationships, patterns, or correlations among a large set of data items.",
    "Attention Projection Matrix": "Matrix used in attention mechanisms within neural networks, particularly in transformer models, to project input vectors into query, key, and value vectors.",
    "Query": "Request made to a data management system or AI model to retrieve information or execute a command based on specific criteria.",
    "Feature Extraction": "Process of transforming raw data into a set of features that are more meaningful and informative for a specific task, such as classification or prediction.",
    "Prompt Chaining": "Technique in AI and ML where multiple prompts or tasks are sequentially connected, allowing the output of one step to become the input for the next, effectively enabling more complex and nuanced operations.",
    "Similarity Masking": "Technique used to filter or obscure less important features in data based on their similarity to other features, enhancing the focus on distinct or more relevant aspects for tasks like ML or pattern recognition.",
    "Search Optimization": "Process of enhancing algorithms' ability to efficiently search for the most optimal solution in a potentially vast solution space.",
    "ADAM (Adaptive Moment Estimation)": "Algorithm for gradient-based optimization of stochastic objective functions, widely used in training DL models.",
    "MLLMs (Multimodal Large Language Models)": "Advanced AI systems capable of understanding and generating information across different forms of data, such as text, images, and audio.",
    "BoW (Bag-of-Words)": "Text representation technique used in NLP to simplify text content by treating it as an unordered set of words.",
    "Function Approximator": "Computational model used to estimate a target function that is generally complex or unknown, often applied in machine learning and control systems.",
    "Proliferation Problem": "The issue of an overwhelming number of options or paths that an algorithm must consider, making computation impractically complex or resource-intensive.",
    "Base Model": "Pre-trained AI model that serves as a starting point for further training or adaptation on specific tasks or datasets.",
    "Prompt Caching": "Practice of storing previously used prompts and their corresponding AI-generated outputs to improve efficiency and reduce computational costs in AI systems.",
    "IRL (Inverse Reinforcement Learning)": "Technique in which an algorithm learns the underlying reward function of an environment based on observed behavior from an agent, essentially inferring the goals an agent is trying to achieve.",
    "KV (Key-Value)": "Data storage model where data is stored as a collection of key-value pairs, where each key is unique and maps directly to a value.",
    "Spacetime Patches": "Technique for transforming video data into a format suitable for ML models by breaking down video into temporal and spatial segments.",
    "Bias": "Systematic errors in data or algorithms that create unfair outcomes, such as privileging one arbitrary group of users over others.",
    "CNN (Convolutional Neural Network)": "Deep learning algorithm that can capture spatial hierarchies in data, particularly useful for image and video recognition tasks.",
    "Dot Product Similarity": "Measures the similarity between two vectors by calculating the sum of the products of their corresponding entries.",
    "Q-Learning": "Model-free reinforcement learning algorithm that seeks to learn the value of actions in a given state, enabling an agent to maximize cumulative reward over time.",
    "Retrieval-Based (Model)": "Algorithms that generate responses by selecting them from a predefined set of responses, based on the input they receive.",
    "DRL (Deep Reinforcement Learning)": "Combines neural networks with a reinforcement learning framework, enabling AI systems to learn optimal actions through trial and error to maximize a cumulative reward.",
    "Fast Weights": "Fast weights are temporary, rapidly changing parameters in neural networks designed to capture transient patterns or short-term dependencies in data.",
    "Autopoiesis": "Systems capable of reproducing and maintaining themselves by regulating their internal environment in response to external conditions.",
    "Markov Chain": "Stochastic model describing a sequence of possible events in which the probability of each event depends only on the state attained in the previous event.",
    "QA (Question Answering)": "Field of natural language processing focused on building systems that automatically answer questions posed by humans in a natural language.",
    "Attention Network": "Type of neural network that dynamically focuses on specific parts of the input data, enhancing the performance of tasks like language translation, image recognition, and more.",
    "Trajectory Generation": "Computational methods for designing the path that an object or agent should follow to reach a destination efficiently and effectively.",
    "Socratic Model": "Conversational AI that is designed to engage in dialogue in a manner akin to Socratic questioning, aiming to stimulate critical thinking and draw out ideas and underlying presuppositions.",
    "Symmetry": "Invariances in data or models where certain transformations do not affect the outcomes or predictions.",
    "Thought Token": "Computational abstraction used in NLP models to represent and manipulate complex ideas or concepts within sequences of text.",
    "Semantic Entropy": "Measure of uncertainty or unpredictability in the meaning of a message or data, often considering the context in which the information is used.",
    "System Prompt": "Predefined message or question generated by an AI system to guide or solicit a response from the user.",
    "1-N Systems": "Architectures where one input or controller manages multiple outputs or agents, applicable in fields like neural networks and robotics.",
    "Capability Control": "Strategies and mechanisms implemented to ensure that AI systems act within desired limits, preventing them from performing actions that are undesired or harmful to humans.",
    "Algorithm": "Step-by-step procedure or formula for solving a problem or performing a task.",
    "Sparse Autoencoder": "Type of neural network designed to learn efficient data representations by enforcing sparsity on the hidden layer activations.",
    "Solution Space": "Refers to the set of all possible solutions to a given problem or decision-making scenario.",
    "Directed Evolution": "Use of evolutionary algorithms to iteratively improve ML models or algorithms by mimicking the process of natural selection.",
    "Compositional Reasoning": "Cognitive process of understanding complex concepts or systems by breaking them down into their constituent parts and understanding the relationships between these parts.",
    "Convergent Learning": "Process by which a ML model consistently arrives at the same solution or prediction given the same input data, despite variations in initial conditions or configurations.",
    "NAS (Neural Architecture Search)": "Automated process that designs optimal neural network architectures for specific tasks.",
    "Speculative Decoding": "AI technique that generates multiple potential outputs simultaneously to improve efficiency and accuracy in tasks like language modeling and neural network inference.",
    "GCC (General Computer Control)": "Ability of an AI system to autonomously manage and utilize a wide range of computer software and systems without specific programming for each individual task.",
    "Knowledge Graph": "Organizes and represents data as an interconnected network of entities (such as objects, events, concepts) and their relationships.",
    "Scalable MatMul-free Language Modeling": "Techniques in natural language processing that avoid matrix multiplication (MatMul) operations to improve scalability and efficiency.",
    "RFM (Robotics Foundational Model)": "Base model designed to provide fundamental capabilities or understanding for the development of various robotic systems and applications.",
    "Recursive Self-Improvement": "Process by which an AI system iteratively improves itself, enhancing its intelligence and capabilities without human intervention.",
    "SSL (Self-Supervised Learning)": "Type of ML where the system learns to predict part of its input from other parts, using its own data structure as supervision.",
    "Subsymbolic AI": "AI approaches that do not use explicit symbolic representation of knowledge but instead rely on distributed, often neural network-based methods to process and learn from data.",
    "Constitutional AI": "Development of foundational principles and regulations that govern the design, deployment, and operation of AI systems to ensure they adhere to ethical standards, human rights, and democratic values.",
    "Similarity Search": "Method used in data science to identify similar items from a large dataset based on their proximity to a given query item (also known as proximity search).",
    "Simulation": "Process of creating a digital model of a real-world or theoretical situation to study the behavior and dynamics of systems.",
    "Chunking Strategy": "Method of grouping similar pieces of information together to simplify processing and enhance memory performance.",
    "OOMs (Orders of Magnitude)": "Way to understand and compare quantities in terms of their scale or size, typically using powers of ten.",
    "Random Walk": "Mathematical concept representing a path consisting of a succession of random steps on some mathematical space.",
    "Perceptron": "Model in neural networks designed to perform binary classification tasks by mimicking the decision-making process of a single neuron.",
    "Structured Search": "Method of querying and retrieving information from databases and other structured data sources where data is organized in defined types and relationships.",
    "Semi-Supervised Learning": "ML approach that uses a combination of a small amount of labeled data and a large amount of unlabeled data for training models.",
    "Silicon-Based Intelligence": "Concept of artificial intelligence systems that operate on silicon-based hardware, contrasting with biological, carbon-based forms of intelligence such as humans.",
    "Greedy Decoding": "Technique used in ML models, especially in NLP, where the model selects the most likely next item in a sequence at each step.",
    "Model Compression": "Techniques designed to reduce the size of a machine learning model without significantly sacrificing its accuracy.",
    "Grokking": "Refers to the process of deeply understanding something intuitively and completely, often used in AI to describe achieving a profound comprehension of complex concepts or systems.",
    "Supervised Learning": "ML approach where models are trained on labeled data to predict outcomes or classify data into categories.",
    "Capability Ladder": "Conceptual framework used to describe the progression of an AI system's abilities from simple, specific tasks to complex, general tasks.",
    "Perceptual Domain": "Range of sensory inputs and interpretations that an AI system can process, akin to human perception systems such as vision, hearing, and touch.",
    "Private Cloud Compute": "Dedicated cloud infrastructure to provide cloud computing services exclusively to a single organization, ensuring enhanced control, privacy, and security.",
    "Instruction Tuning": "Process used in ML to optimize a language model’s responses for specific tasks by fine-tuning it on a curated set of instructions and examples.",
    "Seq2Seq (Sequence to Sequence)": "Neural network architecture designed to transform sequences of data, such as converting a sentence from one language to another or translating speech into text.",
    "Graph Theory": "Field of mathematics and computer science focusing on the properties of graphs, which are structures made up of vertices (or nodes) connected by edges.",
    "Super Prompting": "Method in AI where specific, carefully crafted input prompts are used to guide a model towards generating more accurate or contextually appropriate outputs.",
    "Scaling Hypothesis": "Enlarging model size, data, and computational resources can consistently improve task performance up to very large scales.",
    "Ngram": "Contiguous sequence of N items from a given sample of text or speech.",
    "Instrumentation": "Techniques and tools used to monitor, measure, and analyze the performance and behavior of AI systems.",
    "Word Vector": "Numerical representations of words that capture their meanings, relationships, and context within a language.",
    "Mechanistic Interpretability": "Study and methods used to understand the specific causal mechanisms through which AI models produce their outputs.",
    "GAT (Graph Attention Network)": "Type of neural network that applies attention mechanisms directly to graphs to dynamically prioritize information from different nodes in the graph.",
    "Turing Test": "Measure of a machine's ability to exhibit intelligent behavior equivalent to, or indistinguishable from, that of a human.",
    "De-Biasing": "Methods and practices used to reduce or eliminate biases in AI systems, aiming to make the systems more fair, equitable, and representative of diverse populations.",
    "Ethical AI": "Practice of creating AI technologies that follow clearly defined ethical guidelines and principles to benefit society while minimizing harm.",
    "Underfitting": "Occurs when a ML model is too simple to capture the underlying pattern of the data it is trained on, resulting in poor performance on both training and testing datasets.",
    "Linear Algebra": "Branch of mathematics focusing on vector spaces and linear mappings between these spaces, which is essential for many machine learning algorithms.",
    "Machine Unlearning": "Process by which an ML model is systematically modified to forget specific data, ensuring that the data no longer influences the model's behavior or decisions.",
    "GPS (General Problem Solver)": "Early AI program designed to simulate human problem-solving processes through a heuristic-based approach.",
    "Diffusion": "Class of generative models used to create high-quality, diverse samples of data by iteratively adding and then reversing noise.",
    "Differential Privacy": "System for publicly sharing information about a dataset by describing the patterns of groups within the dataset while withholding information about individuals in the dataset.",
    "Steerability": "Ability to intentionally manipulate the output of the network in a specific direction by applying predetermined modifications to its inputs or parameters.",
    "Paperclip Maximizer": "Theoretical AI designed to maximize the production of paperclips, illustrating the potential dangers of an AI system pursuing a goal without proper constraints.",
    "Ensemble Learning": "ML paradigm where multiple models (often called \"weak learners\") are trained to solve the same problem and combined to improve the accuracy of predictions.",
    "Targeted Adversarial Examples": "Inputs intentionally designed to cause a machine learning model to misclassify them into a specific, incorrect category.",
    "NPC (Non-Player Character)": "Character in a virtual environment that operates under AI control, exhibiting behaviors or responses not directed by human players.",
    "Attention": "Refers to mechanisms that allow models to dynamically focus on specific parts of input data, enhancing the relevance and context-awareness of the processing.",
    "GNN (Graph Neural Networks)": "Type of neural network designed for processing data represented in graph form, capturing relationships and structure within the data.",
    "Boltzmann Machine": "Stochastic recurrent neural network used to learn and represent complex probability distributions over binary variables.",
    "Adapter Layer": "Neural network layer used to enable transfer learning by adding small, trainable modules to a pre-trained model, allowing it to adapt to new tasks with minimal additional training.",
    "Tunable Parameters": "Variables in an AI model that are adjusted during training to optimize the model's performance on a given task.",
    "Singularity": "Hypothetical future point at which technological growth becomes uncontrollable and irreversible, resulting in unforeseeable changes to human civilization.",
    "GCN (Graph Convolutional Networks)": "Class of neural networks designed to operate on graph-structured data, leveraging convolutional layers to aggregate and transform features from graph nodes and their neighbors.",
    "MLE (Maximum Likelihood Estimation)": "Statistical method used to estimate the parameters of a probability distribution by maximizing a likelihood function.",
    "MoE (Mixture of Experts)": "ML architecture that utilizes multiple specialist models (experts) to handle different parts of the input space, coordinated by a gating mechanism that decides which expert to use for each input.",
    "Situational Models": "Cognitive frameworks that allow AI systems to understand and predict dynamic environments by continuously integrating contextual information.",
    "ZSL (Zero-Shot Learning)": "ML technique where a model learns to recognize objects, tasks, or concepts it has never seen during training.",
    "Model-Based Classifier": "ML algorithm that uses a pre-defined statistical model to make predictions based on input data.",
    "AutoML (Automated Machine Learning)": "Streamlines the process of applying ML by automating the tasks of selecting the appropriate algorithms and tuning their hyperparameters.",
    "Preference Model": "Computational framework used to predict and understand an individual's preferences, often applied in recommendation systems and decision-making processes.",
    "Fairness-Aware Machine Learning": "Focuses on developing algorithms that ensure equitable treatment and outcomes across different demographic groups.",
    "Scale Separation": "Distinguishing between phenomena or variables that operate on distinctly different magnitudes, time scales, or spatial dimensions.",
    "Post-Training": "Techniques and adjustments applied to neural networks after their initial training phase to enhance performance, efficiency, or adaptability to new data or tasks.",
    "Teacher Model": "Pre-trained, high-performing model that guides the training of a simpler, student model, often in the context of knowledge distillation.",
    "SAE (Structural Adaptive Embeddings)": "Embedding technique that dynamically adapts to the structural properties of the data to improve the representation of complex relationships within the dataset.",
    "Structured Generation": "Process where outputs are produced in a structured format, often requiring adherence to specific formats or templates, such as tables, graphs, or well-organized textual reports.",
    "Fine Tuning": "Method used in ML to adjust the parameters of an already trained model to improve its accuracy on a specific, often smaller, dataset.",
    "PDS (Psychological Depth Scale)": "Tool used to measure the complexity and depth of an individual's psychological experiences and inner life.",
    "Encoder-Decoder Models": "Class of deep learning architectures that process an input to generate a corresponding output.",
    "Information Gap": "Discrepancy between the information needed to solve a problem or make a decision and the information that is actually available.",
    "Observability": "Capability to monitor and understand the internal states of an AI system through its outputs.",
    "Federated Learning": "ML approach enabling models to be trained across multiple decentralized devices or servers holding local data samples, without exchanging them.",
    "General World Model": "AI systems designed to generate internal representations of the world, enabling them to predict and interact with their environment effectively across a broad range of scenarios.",
    "Complex Interaction": "Intricate, multi-layered exchanges or behaviors between components of an AI system, or between the AI system and its environment, which may involve non-linear dynamics and feedback loops.",
    "Loss Function": "Quantifies the difference between the predicted values by a model and the actual values, serving as a guide for model optimization.",
    "Hash Table": "Data structure that stores key-value pairs and allows for fast data retrieval by using a hash function to compute an index into an array of buckets or slots, from which the desired value can be found.",
    "Universality": "Concept that certain computational systems can simulate any other computational system, given the correct inputs and enough time and resources.",
    "Covariance": "How much two random variables change together",
    "Overparameterized": "ML model that has more parameters than the number of data points available for training.",
    "Saturation Effect": "Phenomenon where the performance improvements of a model diminish as the complexity of the model or the amount of training data increases beyond a certain point.",
    "Frontier Models": "The most advanced and powerful AI models currently available, pushing the boundaries of AI capabilities towards achieving general intelligence.",
    "Criteria Drift": "Phenomenon where the criteria used to evaluate a ML model change over time, leading to a potential decline in the model's performance.",
    "AmI (Ambient Intelligence)": "Electronic environments that are sensitive, adaptive, and responsive to the presence of people, aiming to enhance the quality of life through seamless integration of technology.",
    "Graph Machine Learning": "AI field that applies ML techniques to graph-structured data, enabling the analysis and prediction of relationships and behaviors among interconnected nodes.",
    "Agentic AI Systems": "Advanced AI capable of making decisions and taking actions autonomously to achieve specific goals, embodying characteristics of agency and decision-making usually associated with humans or animals.",
    "Unstructured Data": "Data that lacks a pre-defined format or organization, making it challenging to collect, process, and analyze using conventional database tools.",
    "Semantic Segmentation": "Process of partitioning a digital image into multiple segments (sets of pixels) to simplify its representation into something more meaningful and easier to analyze, where each segment corresponds to different objects or parts of objects.",
    "Model Layer": "Discrete level in a neural network where specific computations or transformations are applied to the input data, progressively abstracting and refining the information as it moves through the network.",
    "Perplexity": "Measure used in language modeling to evaluate how well a model predicts a sample of text, quantifying the model's uncertainty in its predictions.",
    "Continual Pre-Training": "Process of incrementally training a pre-trained ML model on new data or tasks to update its knowledge without forgetting previously learned information.",
    "Dimension Returns": "The output shape or size of the dimensions in a dataset, matrix, or tensor after a specific operation is performed, which is critical in ensuring proper alignment and compatibility in machine learning models.",
    "TPU (Tensor Processing Units)": "Specialized hardware accelerators designed to significantly speed up the calculations required for ML tasks.",
    "IFEval (Instruction-Following Eval)": "Methodology designed to assess the ability of AI systems to follow and execute human-given instructions accurately and effectively.",
    "Inference-Time Reasoning": "Process by which a trained AI model applies learned patterns to new data to make decisions or predictions during its operational phase.",
    "Bayesian Inference": "Method of statistical inference in which Bayes' theorem is used to update the probability estimate for a hypothesis as more evidence or information becomes available.",
    "Prompt Engineering": "Process of carefully designing input prompts to elicit desired outputs from language models.",
    "bGPT (Byte-Level Transformer)": "Variant of the GPT architecture designed to process data at the byte level rather than at the word or sub-word level, allowing for greater flexibility in handling diverse text types and structures.",
    "ReLU (Rectified Linear Unit)": "Activation function commonly used in neural networks which outputs the input directly if it is positive, otherwise, it outputs zero.",
    "TensorFlow": "Open-source software library for machine learning, developed by Google, used for designing, building, and training deep learning models.",
    "Cross-Attention": "Mechanism in neural networks that allows the model to weigh and integrate information from different input sources dynamically.",
    "Attention Mechanisms": "Dynamically prioritize certain parts of input data over others, enabling models to focus on relevant information when processing complex data sequences.",
    "UTM (Universal Turing Machine)": "Theoretical construct in computer science that can simulate any other Turing machine's computing process given the appropriate input and its own machine's description.",
    "HPOC (Human Point of Contact)": "Designated person responsible for overseeing and managing interactions between an AI system and its users or other systems.",
    "Continuous Learning": "Systems and models that learn incrementally from a stream of data, updating their knowledge without forgetting previous information.",
    "Internet Scale": "Systems, applications, or analyses designed to handle and process the vast and diverse data sets available across the entire internet.",
    "AI Governance": "Set of policies, principles, and practices that guide the ethical development, deployment, and regulation of artificial intelligence technologies.",
    "LLM (Large Language Model)": "Advanced AI systems trained on extensive datasets to understand, generate, and interpret human language.",
    "Word Salad": "Disorganized and nonsensical sequence of words or letters, often making it difficult or impossible to derive coherent meaning from the text.",
    "CD (Contrastive Divergence)": "Algorithm used to approximate the gradient of the log-likelihood for training probabilistic models.",
    "Control Vector": "Computational mechanism used in AI models to adjust certain characteristics of the model's outputs based on specific parameters or conditions.",
    "Knowledge Representation": "Method by which AI systems formalize and utilize the knowledge necessary to solve complex tasks.",
    "Artefactual Autopoiesis": "Design and creation of artificial systems capable of self-maintenance and reproduction, mirroring the autopoietic characteristics of living organisms.",
    "FHE (Fully Homomorphic Encryption)": "Type of encryption that allows computation on ciphertexts, producing an encrypted result that, when decrypted, matches the result of operations performed on the plaintext.",
    "Jailbreaking": "Exploiting vulnerabilities in AI systems to bypass restrictions and unlock otherwise inaccessible functionalities.",
    "Weight": "Represents a coefficient for a feature in a model that determines the influence of that feature on the model's predictions.",
    "End-to-End Learning": "ML approach where a system is trained to directly map input data to the desired output, minimizing the need for manual feature engineering.",
    "Meta-Classifier": "Algorithm that combines multiple ML models to improve prediction accuracy over individual models.",
    "Xavier's Initialization": "Weight initialization technique designed to keep the variance of the outputs of a neuron approximately equal to the variance of its inputs across layers in a deep neural network.",
    "Centaur": "Collaborative system where humans and AI work together, combining human intuition and expertise with AI's computational power and data processing capabilities.",
    "Super Alignment": "Theoretical concept in AI, primarily focusing on ensuring that advanced AI systems or AGI align closely with human values and ethics to prevent negative outcomes.",
    "Rejection Sampling": "Method used to generate samples from a probability distribution by proposing candidates from a simpler distribution and accepting or rejecting them based on a criterion related to the target distribution.",
    "Slop": "Colloquial slang referring to responses generated by  LLMs that may be overly verbose or repetitive, often observed in AI-generated summaries or answers, and sometimes criticized for lacking conciseness or relevance.",
    "RL (Reinforcement Learning)": "Type of ML where an agent learns to make decisions by performing actions in an environment to achieve a goal, guided by rewards.",
    "Gabor Function": "Mathematical tool used in image processing and signal analysis, known for its ability to localize information in both the spatial and frequency domains simultaneously.",
    "Scaffolding": "Method of gradually building up the complexity of tasks or learning environments to help an AI system develop more sophisticated capabilities over time.",
    "Model Garden": "Centralized repository that houses a collection of pre-trained machine learning models designed to be easily accessible and reusable by developers and researchers.",
    "Model Level": "Abstraction layer at which an AI or ML model operates, focusing on the specific details and mechanics of the model's architecture and functioning.",
    "Bellman Equation": "Recursive formula used to find the optimal policy in decision-making processes, particularly in the context of dynamic programming and RL.",
    "Teacher-Guided Rejection Sampling": "Advanced ML technique that refines a model by iteratively sampling and accepting data based on evaluations from multiple expert models (teachers).",
    "BQL (Binary Quantization Learning)": "ML method that aims to reduce model complexity and computational cost by quantizing weights and activations to binary values.",
    "Skill Differential": "Variation in performance levels between individuals or groups due to differences in skills, experience, or knowledge, particularly within the same task or profession.",
    "Temperature": "Hyperparameter that controls the randomness of predictions by adjusting the probability distribution of the output classes to make the model's predictions more or less deterministic.",
    "Value Matrix": "Structured format for organizing and displaying data, often used in machine learning to represent input data and their corresponding outputs or labels.",
    "Long-Context Modeling": "Techniques and architectures designed to process and understand sequences of data that are significantly longer than those typically handled by conventional models, enabling better performance on tasks requiring extended context.",
    "Hyperparameter": "Configuration settings used to structure ML models, which guide the learning process and are set before training begins.",
    "Self-Reasoning Token": "AI mechanism designed to enhance the planning capabilities of language models by allowing them to anticipate and prepare for future outputs.",
    "GFlowNet (Generative Flow Networks)": "Research direction at the intersection of reinforcement learning, deep generative models, and energy-based probabilistic modeling, aimed at improving generative active learning and unsupervised learning.",
    "Metaheuristic": "High-level problem-independent algorithmic framework that provides a set of guidelines or strategies to develop heuristic optimization algorithms.",
    "Unsupervised Learning": "Type of ML where algorithms learn patterns from untagged data, without any guidance on what outcomes to predict.",
    "VAE (Variable AutoEncoder)": "Type of generative model that leverages neural networks to encode input data into a latent space and then reconstruct it back to the original input.",
    "Masking": "Technique used in NLP models to prevent future input tokens from influencing the prediction of current tokens.",
    "AIT (Algorithmic Information Theory)": "Studies the complexity of strings and the amount of information they contain, using algorithms and computational methods.",
    "NLP (Neuro-Linguistic Programming)": "Techniques and methodologies for understanding and generating human language by computers.",
    "Surrogate Objective": "Alternative goal used to approximate or replace a primary objective in optimization problems, especially when the primary objective is difficult to evaluate directly.",
    "ViTs (Vision Transformers)": "Class of DL models that apply the transformer architecture, originally designed for natural language processing, to computer vision tasks.",
    "Decidability": "Whether a problem can be algorithmically solved, meaning there exists a clear procedure (algorithm) that will determine a yes-or-no answer for any given input within a finite amount of time.",
    "Policy Gradient Algorithm": "Type of RL algorithm that optimizes the policy directly by computing gradients of expected rewards with respect to policy parameters.",
    "Semantic Indexing": "Structured representation of information that captures the meaning and relationships between concepts, enabling more effective search and retrieval of data based on the meaning of words rather than just keyword matches.",
    "Expert System": "Computer program designed to mimic the decision-making abilities of a human expert in a specific domain.",
    "Multiagent": "Multiple autonomous entities (agents) interacting in a shared environment, often with cooperative or competitive objectives.",
    "Hybrid AI": "Combines symbolic AI (rule-based systems) and sub-symbolic AI (machine learning) approaches to leverage the strengths of both for more versatile and explainable AI systems.",
    "Quantization": "Process of reducing the precision of the weights and activations in neural network models to decrease their memory and computational requirements.",
    "Federated Training": "Decentralized machine learning approach where multiple devices or nodes collaboratively train a shared model while keeping their data localized, rather than aggregating it centrally.",
    "LNN (Liquid Neural Network)": "Type of artificial neural network designed to process data that changes over time, such as time series data, by simulating a more dynamic and fluid-like behavior.",
    "VAE (Variational Autoencoders)": "Class of generative models that use neural networks to encode inputs into a latent space and then decode from this space to reconstruct the input or generate new data that resemble the input data.",
    "Q-Value": "Measure used in RL to represent the expected future rewards that an agent can obtain, starting from a given state and choosing a particular action.",
    "ASL (AI Safety Level)": "Tiered system for categorizing the risk levels associated with AI systems to guide their development and deployment responsibly.",
    "Adapter": "Lightweight, modular component added to a pre-trained model to fine-tune it for specific tasks without altering the original model's parameters significantly.",
    "Confidential Computing": "Security measure that protects data in use by performing computation in a hardware-based environment, preventing unauthorized access or visibility even if the system is compromised.",
    "Policy Gradient": "Class of algorithms in RL that optimizes the parameters of a policy directly through gradient ascent on expected future rewards.",
    "SSF (Stochastic Similarity Filter)": "Moderates GPU usage by skipping processing of similar consecutive input images, thereby improving computational efficiency in real-time image and video generation tasks.",
    "Swarm Intelligence": "Form of AI inspired by the collective behavior of social insects and animals, used to solve complex problems through decentralized, self-organized systems.",
    "Rank Fusion": "Technique used to combine multiple ranked lists of items, such as search engine results, into a single aggregated ranking that ideally reflects the consensus or most relevant ordering.",
    "Boosting": "ML ensemble technique that combines multiple weak learners to form a strong learner, aiming to improve the accuracy of predictions.",
    "LTPA (Long-Term Planning Agent)": "AI system designed to make decisions over extended periods, considering future consequences and outcomes.",
    "Hyperplane": "Mathematical concept that represents a subspace in n-dimensional space, with one dimension less than the space itself, used extensively to separate data points in various dimensions.",
    "Flow Engineering": "Structured process of improving problem-solving in tasks like code generation by guiding a model through systematic, iterative refinements based on feedback loops.",
    "ACO (Ant Colony Optimization)": "Probabilistic technique for solving computational problems which can be reduced to finding good paths through graphs, inspired by the behavior of ants seeking paths between their colony and food sources.",
    "Numerical Processing": "Algorithms and techniques for handling and analyzing numerical data to extract patterns, make predictions, or understand underlying trends.",
    "Blind Alley": "Situation in problem-solving where a path or strategy leads nowhere, offering no further possibilities for progress or solution.",
    "Discontinuous Jump": "Sudden, significant leap in the performance or capability of an AI system, deviating sharply from its previous trajectory of incremental improvements.",
    "CSPs (Constraint Satisfaction Problems)": "Mathematical problems defined by a set of variables, a domain of values for each variable, and a set of constraints specifying allowable combinations of values.",
    "Foom": "Hypothetical rapid and uncontrollable growth of an AI's capabilities, leading to a superintelligent entity in a very short period.",
    "Matryoshka Embedding": "Method of representing nested structures in data using embeddings that encapsulate multiple layers of information, similar to Russian Matryoshka nesting dolls.",
    "TESCREAL": "Seven ideologies: Transhumanism, Extropianism, Singularitarianism, Cosmism, Rationalism, Effective Altruism, and Longtermism. They all focus on using technology to improve people’s lives and they are deeply influential among people working on AGI.",
    "Bagging": "ML ensemble technique that improves the stability and accuracy of machine learning algorithms by combining multiple models trained on different subsets of the same data set.",
    "Activation Beacon": "Method used in LLMs to extend the context window they can process by employing a technique of condensing and streamlining longer text sequences.",
    "MIMS (Multiple Instance Learning for Missing Annotations)": "ML approach where training occurs on labeled bags of instances instead of individual instances, particularly useful when exact annotations are missing.",
    "Sample Efficiency": "Ability of a ML model to achieve high performance with a relatively small number of training samples.",
    "Multimodal": "AI systems or models that can process and understand information from multiple modalities, such as text, images, and sound.",
    "Embodied AI": "Integration of AI into physical entities, enabling these systems to interact with the real world through sensory inputs and actions.",
    "Probabilistic Programming": "Programming paradigm designed to handle uncertainty and probabilistic models, allowing for the creation of programs that can make inferences about data by incorporating statistical methods directly into the code.",
    "Sequence Model": "Model designed to process and predict sequences of data, such as time series, text, or biological sequences.",
    "Parametric Knowledge": "Information and patterns encoded within the parameters of a machine learning model, which are learned during the training process.",
    "Embodied Intelligence": "Intelligence emerging from the physical interaction of an agent with its environment, emphasizing the importance of a body in learning and cognition.",
    "Autoformalization": "Process of automatically converting natural language descriptions or informal mathematical ideas into formal mathematical or logical expressions using AI.",
    "LAQ (Locally-Adaptive Quantization)": "Technique used in data compression and neural network optimization that adjusts quantization levels based on local data characteristics to improve accuracy and efficiency.",
    "Structured Data": "Information that is highly organized and formatted in a way that is easily searchable and accessible by computer systems, typically stored in databases.",
    "Meta Prompt": "AI technique that emphasizes the structural and syntactical framework of prompts to guide models in problem-solving and task execution, prioritizing the 'how' of information presentation over the 'what'.",
    "Forward Propagation": "Process in a neural network where input data is passed through layers of the network to generate output.",
    "Custom Instructions": "Directives or rules provided by users to AI systems, tailoring the AI's responses or behaviors to specific needs or contexts.",
    "Manifold Learning": "Type of non-linear dimensionality reduction technique used to uncover the underlying structure of high-dimensional data by assuming it lies on a lower-dimensional manifold.",
    "Groundedness": "Property of language models that ensures their generated content or interpretations are closely tied to or derived from real-world knowledge and contexts.",
    "DLMs (Deep Language Models)": "Advanced ML models designed to understand, generate, and translate human language by leveraging DL techniques.",
    "Privileged Instructions": "Commands in computing that can only be executed in a privileged mode, typically restricted to the operating system or other system-level software to manage hardware and critical operations securely.",
    "Horizon": "Length of the future over which decisions are considered, with long horizon involving many future steps and short horizon involving only a few.",
    "Branching Factor": "Number of possible actions or moves that can be taken from any given point in a decision-making process, such as in game trees or search algorithms.",
    "Decision Tree": "Flowchart-like tree structure where each internal node represents a \"test\" on an attribute, each branch represents the outcome of the test, and each leaf node represents a class label (decision taken after computing all attributes).",
    "Context Window": "Predefined span of text surrounding a specific word or phrase that algorithms analyze to determine its meaning, relevance, or relationship with other words.",
    "Scientific Computing": "Computational methods and tools to solve complex scientific and engineering problems.",
    "Lovelace Test": "Designed to determine a machine's capability to create art or other outputs that it was not explicitly programmed to generate, challenging it to fool a human into believing the outputs were created by a human.",
    "DQN (Deep Q-Networks)": "RL technique that combines Q-learning with deep neural networks to enable agents to learn how to make optimal decisions from high-dimensional sensory inputs.",
    "Model Drift Minimization": "Strategies and methodologies to ensure that a ML model remains accurate and relevant over time as the underlying data changes.",
    "DP (Dynamic Programming)": "Method used in computer science and mathematics to solve complex problems by breaking them down into simpler subproblems and solving each of these subproblems just once, storing their solutions.",
    "Stochastic": "Systems or processes that are inherently random, involving variables that are subject to chance.",
    "Self-Attention": "Mechanism in neural networks that allows models to weigh the importance of different parts of the input data differently.",
    "Three Laws of Robotics": "Set of ethical guidelines designed to govern the behavior of robots and ensure their safe interaction with humans, proposed by science fiction writer Isaac Asimov.",
    "Low-Bit Palletization": "Process of reducing the bit depth of data representations to streamline computation and improve efficiency in neural network processing and other AI applications.",
    "Dualism": "Theory or concept that emphasizes the division between symbolic (classical) AI and sub-symbolic (connectionist) AI.",
    "Eval (Evaluation)": "Process of assessing the performance and effectiveness of an AI model or algorithm based on specified criteria and datasets.",
    "Token Speculation Techniques": "Strategies used in NLP models to predict multiple potential tokens (words or subwords) in parallel, improving the efficiency of text generation.",
    "HITL (Human-in-the-Loop)": "Integration of human judgment into AI systems to improve or guide the decision-making process.",
    "Local Pooling": "Process that reduces the spatial dimensions of input data by aggregating information in local regions to create more abstract representations.",
    "Mode Collapse": "Phenomenon in Generative Adversarial Networks (GANs) where the generator produces limited, highly similar outputs, ignoring the diversity of the target data distribution.",
    "Spatial Intelligence": "Ability of a system to understand, reason, and manipulate spatial relationships and properties within its environment.",
    "GPU (Graphics Processing Unit)": "Specialized electronic circuit designed to rapidly manipulate and alter memory to accelerate the creation of images in a frame buffer intended for output to a display device, but widely used in deep learning for its parallel processing capabilities.",
    "Find+Replace Transformers": "Novel architectural extension of traditional transformers, designed to achieve Turing completeness and enhance model performance on complex tasks.",
    "Ablation": "Method where components of a neural network are systematically removed or altered to study their impact on the model's performance.",
    "Assistant": "Software system designed to perform tasks or services for an individual, often leveraging NLP and ML to interact and respond intelligently.",
    "On-the-fly Program Synthesis": "Automatic creation of executable code in real-time, typically during the execution of a program or in response to specific, immediate computational needs.",
    "Adversarial Attacks": "Manipulating input data to deceive machine learning models, causing them to make incorrect predictions or classifications.",
    "Meta-Regressor": "Type of ensemble learning method that uses the predictions of several base regression models to train a second-level model to make a final prediction.",
    "Secure Enclave": "Hardware-based security feature designed to protect sensitive data by isolating it in a dedicated and secure area of a processor.",
    "Scalar": "Single numerical value, typically representing a quantity or magnitude in mathematical or computational models."
}